<?php


return [

    "140001" => "订单号必须填写",
    "140002" => "订单号格式不正确",
    "140003" => "订单状态不正确",

    "140004" => "快递ID必须填写",
    "140005" => "快递ID格式不正确",
    "140006" => "地址ID必须填写",
    "140007" => "优惠券必须为字符串",
    "140008" => "product_sku_ids必须填写",
    "140009" => "product_sku_ids必须为数组",
    "140010" => "备注必须为字符串",




    "149001" => "订单不存在",
    "149002" => "订单无权查看",
    "149003" => "优惠券不存在",
    "149004" => "该商品库存不足",
    "149005" => "该优惠券已被兑完",
    "149006" => "订单已支付不能取消",
    "149007" => "该订单未支付，不可退款",
    "149008" => "众筹订单不支持退款",
    "149009" => "该订单已经申请过退款，请勿重复申请",
    "149010" => "发货状态不正确",
];
