<?php


return [
    # 传入验证
    "100001" => "用户名称为字符串",
    "100002" => "email格式不正确",
    "100003" => "简介为字符串",
    "100004" => "头像图片ID必须为整数",

    "100005" => "验证key必须填写",
    "100006" => "验证key必须为字符串",
    "100007" => "验证码必须填写",
    "100008" => "验证码必须为字符串",
    "100009" => "电话必须填写",
    "100010" => "电话格式不正确",
    "100011" => "页码必须为整数",

    "100012" => "省份必须填写",
    "100013" => "省份必须为字符串",
    "100014" => "省份编码必须填写",
    "100015" => "省份编码必须为字符串",
    "100016" => "城市必须填写",
    "100017" => "城市必须为字符串",
    "100018" => "城市编码必须填写",
    "100019" => "城市编码必须为字符串",
    "100020" => "地区必须填写",
    "100021" => "地区必须为字符串",
    "100022" => "地区编码必须填写",
    "100023" => "地区编码必须为字符串",
    "100024" => "用户地址必须填写",
    "100025" => "用户地址为字符串",



    # 错误码
    "109001" => "验证码已经失效",
    "109002" => "验证码错误",
    "109003" => "手机号已经存在",
    "109004" => "地址不存在",
    "109005" => "地址不可访问",

];
